# Pandas DataFrame exercises

In [ ]:
import numpy as np

import pandas as pd

--------
## DataFrame creation

### Crie um DataFrame Vazio

In [ ]:
df = pd.DataFrame()

In [ ]:
print(df)

<img width=400 src="https://cdn.dribbble.com/users/4678/screenshots/1986600/avengers.png"></img>


### Crie um  `marvel_df` com os dados abaixo

In [ ]:
marvel_data = [
    ['Spider-Man', 'male', 1962],
    ['Captain America', 'male', 1941],
    ['Wolverine', 'male', 1974],
    ['Iron Man', 'male', 1963],
    ['Thor', 'male', 1963],
    ['Thing', 'male', 1961],
    ['Mister Fantastic', 'male', 1961],
    ['Hulk', 'male', 1962],
    ['Beast', 'male', 1963],
    ['Invisible Woman', 'female', 1961],
    ['Storm', 'female', 1975],
    ['Namor', 'male', 1939],
    ['Hawkeye', 'male', 1964],
    ['Daredevil', 'male', 1964],
    ['Doctor Strange', 'male', 1963],
    ['Hank Pym', 'male', 1962],
    ['Scarlet Witch', 'female', 1964],
    ['Wasp', 'female', 1963],
    ['Black Widow', 'female', 1964],
    ['Vision', 'male', 1968]
]

In [65]:
marvel_df = pd.DataFrame(marvel_data, columns=['Name', 'Gen', 'Year'])
marvel_df

                Name     Gen  Year
0         Spider-Man    male  1962
1    Captain America    male  1941
2          Wolverine    male  1974
3           Iron Man    male  1963
4               Thor    male  1963
5              Thing    male  1961
6   Mister Fantastic    male  1961
7               Hulk    male  1962
8              Beast    male  1963
9    Invisible Woman  female  1961
10             Storm  female  1975
11             Namor    male  1939
12           Hawkeye    male  1964
13         Daredevil    male  1964
14    Doctor Strange    male  1963
15          Hank Pym    male  1962
16     Scarlet Witch  female  1964
17              Wasp  female  1963
18       Black Widow  female  1964
19            Vision    male  1968


### Adicione a coluna nomes ao DF

### Adicione o index `marvel_df` (use o nome dos personagens como index)

In [61]:
marvel_df.head()

              Name   Sex  Year
0       Spider-Man  male  1962
1  Captain America  male  1941
2        Wolverine  male  1974
3         Iron Man  male  1963
4             Thor  male  1963

In [62]:
marvel_df.set_index('Name', inplace=True)

In [ ]:
marvel_df.head(2)

### Drop a coluna nome visto que agora ela é o index

In [68]:
marvel_df.index.name = None

In [69]:
marvel_df.head()

                Gender  Year
Spider-Man        male  1962
Captain America   male  1941
Wolverine         male  1974
Iron Man          male  1963
Thor              male  1963


### Drop Namor e Hank Pyn

In [73]:

marvel_df.drop(['Namor', 'Hank Pym'], axis=0, inplace=True)


## DataFrame selection, slicing and indexation

### Mostre os primeiros 5 elementos do dataframe

In [77]:
marvel_df.head()

                Gender  Year
Spider-Man        male  1962
Captain America   male  1941
Wolverine         male  1974
Iron Man          male  1963
Thor              male  1963


### Mostre os 4 últimos elementos do dataframe

In [78]:
marvel_df.tail(4)

               Gender  Year
Scarlet Witch  female  1964
Wasp           female  1963
Black Widow    female  1964
Vision           male  1968


### Mostre somente o sexto dos 5 primeiros elementos do DF `marvel_df`

In [82]:
marvel_df['Gender'].head()

Spider-Man         male
Captain America    male
Wolverine          male
Iron Man           male
Thor               male
Name: Gender, dtype: object


### Mostre a primeira aparição dos elementos do meio `marvel_df`

### Mostre os primeiros e últimos elementos `marvel_df`

In [94]:
display(marvel_df.head(1), marvel_df.tail(1))

           Gender  Year
Spider-Man   male  1962

       Gender  Year
Vision   male  1968

## DataFrame manipulação e operação

### Modifique a  `first_appearance` do 'Vision' para o ano 1964


### Adicione uma nova coluna para o dataframe  `marvel_df` chamada   'years_since' com os anos desde  `first_appearance`


## DataFrame boolean arrays

### Dê ao  `marvel_df` mostrando somente os personagens femininos


### Given the `marvel_df` pandas DataFrame, get the male characters


### Given the `marvel_df` pandas DataFrame, get the characters with `first_appearance` after 1970


### Given the `marvel_df` pandas DataFrame, get the female characters with `first_appearance` after 1970

## DataFrame summary statistics